{
  "education": [
    {
      "awards_achievements": [
        "Undergraduate Entrance Bursary (2021)",
        "Engineering Excellence Scholarship (2022)"
      ],
      "degree": "Bachelor of Engineering (Software Engineering, Co-op)",
      "department": "Gina Cody School of Engineering",
      "duration": "2021 - 2025",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": [
        "Honor Roll Student (2020, 2021)"
      ],
      "degree": "Diploma of College Studies (Health Sciences)",
      "department": "Science",
      "duration": "2019 - 2021",
      "school_name": "Champlain College Saint-Lambert"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_FadouaDoghmane",
  "highlighted_projects": [
    {
      "description": "Developed an AI-powered waste classification system using Python and PyTorch to automate the sorting of 10 waste classes and reduce landfill dependency.  Implemented data preprocessing, augmentation, and visualization, trained and evaluated MobileNet, ResNet50, and VGG16 CNN models, and achieved 82.79% test accuracy with MobileNet.  Created modular notebooks and scripts for reproducible training, evaluation, and deployment on sample datasets.  The project enabled scalable and efficient AI-driven waste sorting while providing robust performance metrics and insights for deployment in real-world recycling applications.\n",
      "name": "AI-Powered Waste Sorting"
    },
    {
      "description": "Built analytical dashboards using Power BI and Excel to evaluate Montreal’s food assistance program distribution. Collected, cleaned, and transformed datasets from multiple sources to ensure accurate reporting.  Designed interactive visualizations to analyze usage patterns, identify underserved areas, and monitor resource allocation efficiency.  Interpreted the data insights independently and provided actionable recommendations to improve program reach and effectiveness.  This project enhanced understanding of food assistance logistics and demonstrated how data-driven decision-making can optimize social programs.\n",
      "name": "Food Assistance Analytics (Hackathon)"
    },
    {
      "description": "Developed a Convolutional Neural Network (CNN) to detect emotions from facial expressions in a team of three.  The project involved dataset preparation, including cleaning, labeling, augmentation, and visualization using Python and Matplotlib.  Implemented multiple CNN variants and trained models to classify emotions such as happy, focused, surprised, and neutral.  Conducted k-fold cross-validation for robust evaluation and mitigated bias in age and gender datasets through re-labeling and retraining.  Delivered final models capable of accurate emotion detection and provided comprehensive documentation of dataset provenance, preprocessing steps, CNN architecture, evaluation metrics, and bias mitigation strategies.\n",
      "git_url": "https://github.com/dogmen6/Emotion-Detector-CNN",
      "name": "Emotion-Detector-CNN"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a lightweight Linux monitoring agent using Bash, Docker, crontab, and PostgreSQL to collect hardware specs and real-time usage metrics across multiple Rocky Linux hosts. Implemented hardware/usage collection scripts, containerized PostgreSQL backend, automated scheduling via crontab, and data analytics queries for performance monitoring.\n",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_FadouaDoghmane/tree/main/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Fadoua Doghmane",
  "others": [
    {
      "bullets": [
        "Reading thrillers and self-development books.",
        "Boxing regularly and trying various martial arts.",
        "Baking desserts from various cultures."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Program",
      "description": "Participating in the Jarvis program to gain practical experience in Linux, Bash scripting, SQL, and Python for data analytics. Focused on building foundational skills in data handling and analysis for enterprise-level applications.\n",
      "duration": "Nov 2025 – Present",
      "title": "Junior Data Engineer Trainee"
    },
    {
      "company": "CrucialLogics",
      "description": "Developed Power BI dashboards to deliver data-driven business insights, built integrations between enterprise tools using REST APIs and Azure Logic Apps, and deployed Copilot agents to automate workflows and enhance productivity. Collaborated with cross-functional teams to analyze requirements and design scalable automation solutions.\n",
      "duration": "May 2024 - Present",
      "title": "Associate Consultant"
    },
    {
      "company": "Bombardier Recreational Products (BRP)",
      "description": "Collaborated with business units to improve data quality by generating Snowflake and Power BI reports, identifying data issues, and documenting processes. Contributed to template creation and workflow documentation to streamline team operations and enhance data reliability.\n",
      "duration": "May 2023 - Aug 2023",
      "title": "Data Quality Intern"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "Docker",
      "Linux",
      "Pandas/Numpy",
      "Data Modeling"
    ],
    "familiar": [
      "PyTorch",
      "PySpark/Apache Spark",
      "Azure Logic Apps",
      "HTML/CSS",
      "React JS"
    ],
    "proficient": [
      "SQL",
      "DBMS (MySQL, Snowflake, PostgreSQL)",
      "Python",
      "Power BI",
      "REST APIs"
    ]
  },
  "summary": "I am a Software Engineering graduate from Concordia University with hands-on\n experience in data integration, workflow automation, and analytics. Through my\n roles at CrucialLogics and BRP, I have built integrations using REST APIs,\n automated workflows with Azure Logic Apps to synchronize data between tools,\n designed Power BI dashboards, and delivered actionable data quality insights\n using SQL and Snowflake. I am currently participating in the Jarvis program to\n further develop my skills and prepare for data-focused roles in enterprise\n environments. I am passionate about leveraging data to improve processes,\n generate insights, and enable informed decision-making. I am seeking developer\n or data-focused engineering roles where I can apply my problem-solving skills,\n technical foundation, and ability to quickly learn and deliver solutions.\n"
}
