{
  "education": [
    {
      "awards_achievements": [
        "Undergraduate Entrance Bursary (2021)",
        "Engineering Excellence Scholarship (2022)"
      ],
      "degree": "Bachelor of Engineering (Software Engineering, Co-op)",
      "department": "Gina Cody School of Engineering",
      "duration": "2021 - 2025",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": [
        "Honor Roll Student (2020, 2021)"
      ],
      "degree": "Diploma of College Studies (Health Sciences)",
      "department": "Science",
      "duration": "2019 - 2021",
      "school_name": "Champlain College Saint-Lambert"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_FadouaDoghmane",
  "highlighted_projects": [
    {
      "description": "Developed an AI-powered waste classification system as part of a team of four, using Python and PyTorch to automate the sorting of ten waste categories and support more sustainable recycling practices. The project involved building a full machine-learning pipeline, including data preprocessing, augmentation, and visualization, and training multiple CNN architectures such as MobileNet, ResNet50, and VGG16. I contributed to creating modular notebooks and scripts to ensure reproducible training, evaluation, and deployment on sample datasets. The system demonstrated scalable, efficient performance and provided clear insights to support real-world implementation in waste management environments.\n",
      "name": "AI-Powered Waste Sorting"
    },
    {
      "description": "I developed analytical dashboards in Power BI to evaluate the distribution efficiency of Montreals food assistance programs. This involved collecting, cleaning, and transforming data from multiple sources to produce reliable reporting outputs. I designed interactive visualizations that revealed usage patterns, highlighted underserved areas, and monitored how resources were allocated across the city. By independently interpreting the findings, I delivered actionable recommendations to help improve program reach and operational effectiveness. This project deepened my understanding of food assistance logistics and demonstrated the impact of data-driven decision-making on social program optimization.\n",
      "name": "Food Assistance Analytics (Hackathon)"
    },
    {
      "description": "Collaborated in a team of three to develop a Convolutional Neural Network capable of detecting emotions from facial expressions. The project included preparing and refining the dataset through cleaning, labeling, augmentation, and visualization, followed by the implementation of multiple CNN variants to classify emotions such as happy, focused, surprised, and neutral. We applied k-fold cross-validation for rigorous evaluation and addressed dataset bias related to age and gender through re-labeling and retraining. The final models were supported with comprehensive documentation detailing data provenance, preprocessing steps, CNN design, evaluation methods, and bias-mitigation strategies.\n",
      "name": "Emotion-Detector-CNN"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a lightweight Linux monitoring agent using Bash, Docker, crontab, and PostgreSQL to collect and store hardware specifications and real-time usage metrics across multiple Rocky Linux hosts. Implemented automated data collection scripts, containerized the PostgreSQL backend, scheduled recurring metric gathering with crontab, and built analytics queries to monitor system performance and resource utilization.\n",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Fadoua Doghmane",
  "others": [
    {
      "bullets": [
        "Practice boxing twice a week and try out different martial arts.",
        "Enjoy baking desserts from diverse backgrounds.",
        "Love exploring world cultures and traditions through books and documentaries."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Program",
      "description": "I am currently enrolled in the Jarvis program to gain practical experience in technologies including SQL, Python, and Linux, which are essential for data engineering. Through the program, I have developed skills in managing and manipulating data in enterprise environments, working with database systems, applying data handling best practices, and using Python for data analytics. I am applying these skills to real-world projects that simulate the challenges faced by data teams in large organizations. By combining programming, data management, and analytical thinking, I am preparing to contribute effectively to data engineering teams, building scalable and reliable data pipelines, ensuring data quality, and supporting data-driven decision making at scale.\n",
      "duration": "Nov 2025 – Present",
      "title": "Junior Data Engineer Trainee"
    },
    {
      "company": "CrucialLogics",
      "description": "Developed interactive Power BI dashboards to provide actionable, data-driven business insights and support strategic decision-making. Built integrations between multiple enterprise tools using REST APIs and Azure Logic Apps to streamline data flows and improve operational efficiency. Deployed Copilot agents to automate repetitive workflows, enhance productivity, and reduce manual effort. Collaborated closely with cross-functional teams to gather requirements, design scalable automation solutions, and ensure seamless implementation. Applied analytical thinking and problem-solving to identify process improvement opportunities and deliver solutions that drive measurable impact across the organization.\n",
      "duration": "May 2024 - Present",
      "title": "Associate Consultant"
    },
    {
      "company": "Bombardier Recreational Products (BRP)",
      "description": "Collaborated with multiple lines of business to improve data quality and ensure accurate reporting by generating detailed Snowflake and Power BI reports, identifying inconsistencies, and documenting key processes. Worked closely with team members to develop standardized templates and workflow documentation, which streamlined operations and enhanced data reliability across projects. Applied analytical thinking to uncover data patterns, address recurring issues, and provide actionable insights that supported informed decision-making. This experience strengthened my skills in data management, reporting, and process optimization while contributing to the overall efficiency and effectiveness of the organization.\n",
      "duration": "May 2023 - Aug 2023",
      "title": "Data Quality Intern"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "Data Modeling",
      "Pandas/Numpy",
      "Docker",
      "Linux"
    ],
    "familiar": [
      "PyTorch",
      "PySpark/Apache Spark",
      "Azure Logic Apps",
      "HTML/CSS",
      "React JS"
    ],
    "proficient": [
      "SQL",
      "DBMS (MySQL, Snowflake, PostgreSQL)",
      "Python",
      "Power BI",
      "REST APIs"
    ]
  },
  "summary": "I am a Software Engineering graduate from Concordia University with hands-on experience in data analytics, workflow automation, and data reporting. In my roles at CrucialLogics and BRP, I developed integrations using REST APIs, automated workflows with Azure Logic Apps to synchronize data across systems, designed Power BI dashboards, and delivered actionable data quality insights using SQL, DAX, and various databases. I am currently participating in the Jarvis program to further strengthen my technical skills and prepare for data-focused roles in enterprise environments. I am passionate about using data to improve processes, uncover insights, and support informed decision-making, and I am seeking data-focused engineering roles where I can apply my problem-solving skills, strong technical foundation, and ability to quickly learn and deliver effective solutions.\n"
}
