{
  "education": [
    {
      "awards_achievements": [
        "Undergraduate Entrance Bursary (2021)",
        "Engineering Excellence Scholarship (2022)"
      ],
      "degree": "Bachelor of Engineering (Software Engineering, Co-op)",
      "department": "Gina Cody School of Engineering",
      "duration": "2021-2025",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": [
        "Honor Roll Student (2020, 2021)"
      ],
      "degree": "Diploma of College Studies (Health Sciences)",
      "department": "Science",
      "duration": "2019-2021",
      "school_name": "Champlain College Saint-Lambert"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_FadouaDoghmane",
  "highlighted_projects": [
    {
      "description": "Developed a CNN-based waste classification model using Python and PyTorch. Implemented data preprocessing, visualization, model training, and performance evaluation to enhance recycling accuracy and reduce landfill dependency.\n",
      "git_url": null,
      "name": "AI-Powered Waste Sorting"
    },
    {
      "description": "Built analytical dashboards using Power BI and Excel to evaluate Montreals food assistance program distribution, generating insights on usage patterns and resource allocation.\n",
      "git_url": null,
      "name": "Food Assistance Analytics (Hackathon)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a lightweight Linux monitoring agent using Bash, Docker, crontab, and PostgreSQL to collect hardware specs and real-time usage metrics across multiple Rocky Linux hosts. Implemented hardware/usage collection scripts, containerized PostgreSQL backend, automated scheduling via crontab, and data analytics queries for performance monitoring.\n",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_FadouaDoghmane/tree/main/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Fadoua Doghmane",
  "others": [
    {
      "bullets": [
        "Reading thrillers and self-development books.",
        "Boxing regularly and trying various martial arts.",
        "Baking desserts from various cultures."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "CrucialLogics",
      "description": "Developed Power BI dashboards to deliver data-driven business insights, built integrations between enterprise tools using REST APIs and Azure Logic Apps, and deployed Copilot agents to automate workflows and enhance productivity. Collaborated with cross-functional teams to analyze requirements and design scalable automation solutions.\n",
      "duration": "May 2024- Present",
      "title": "Associate Consultant"
    },
    {
      "company": "Bombardier Recreational Products (BRP)",
      "description": "Collaborated with business units to improve data quality by generating Snowflake and Power BI reports, identifying data issues, and documenting processes. Contributed to template creation and workflow documentation to streamline team operations and enhance data reliability.\n",
      "duration": "May 2023- Aug 2023",
      "title": "Data Quality Intern"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "Docker",
      "Linux",
      "Pandas/Numpy",
      "Data Modeling"
    ],
    "familiar": [
      "React JS",
      "PyTorch",
      "HTML/CSS/JavaScript",
      "PySpark/Apache Spark",
      "Azure Logic Apps"
    ],
    "proficient": [
      "SQL",
      "DBMS (MySQL, Snowflake, PostgreSQL)",
      "Python",
      "Power BI",
      "REST APIs"
    ]
  },
  "summary": "I am a Software Engineering graduate with hands-on experience in data integration, workflow automation, and analytics. Through my roles at CrucialLogics and BRP, I have built integrations using REST APIs, automated workflows with Azure Logic Apps to synchronize data between tools, designed Power BI dashboards, and delivered actionable data quality insights using SQL and Snowflake. I am passionate about leveraging data to improve processes, generate insights, and enable informed decision-making. I am seeking developer or data-focused engineering roles where I can apply my problem-solving skills, technical foundation, and ability to quickly learn and deliver solutions.\n"
}
